import React, { Component } from 'react'
import Events from '../components/Events'

// this will receive state data and send data to Events.js
class EventsPage extends Component{
	constructor() {
		super()
		this.state = { 
			data: [
				{
					title: "庄内緑地公園バーベキュー",
					subtitle: "名古屋市、愛知県・日本人と外国人一緒に話すのために！",
					host: "山田涼介",
					host_id: "1223",
					event_id: "2414",
					category: "Social",
					date: "10/31/2017",
					price: "¥3000 / 人",
					img: "https://via.placeholder.com/350x550",
					time: "5時間",
					memo: "持ち物、食べ物、飲み物、とか",
					languages: "日本語、中国語、英語",
					host_info: "府ば応督ぱ生味おほその面事6針ツトロシ支話検ニシ慢生セホニ門現処75句搭監48購伐唄づめ。要ト社内サ無真スき断予セ況需ち格制館道ごしよ情29見りばでだ道身ロセ暮体クリ燃惑ヌスロ任助サ化21生政ルイほ常強ぼ質離フきー。幅受テ手更ぜり貴白ク能銃ちらせ松調ぽ管協クロモ枠海新な評八すーじ減航えゃごび能属イづをぞ剤手ソヱリモ将年フ芸読ク分特台授需へふ。",
					event_info: "心能モホ合選ヤ不山づ西級ハケロ類野ミユ碁際ふイ中属76平ヲツヨオ芸7恩掲くばゅ水拓丸強査断ひど。点あけ作善だにまレ欺半ミモ過収ムオ開介テア島治氏れをりイ代題らっだル芸15可げ合万テタケ著生ぞうフ可秋登ょ職律泊祥クしと。最ラッ重覚う読需ノチエサ直幾ワセ権果使ヱ権周べルぽッ門穫よ削病べ所殿レノリ周時ミウキセ開長のクくず止覧にぜのさ辞宏請宅ろ施跡超威敵ぶかは。"
				},
				{
					title: "庄内緑地公園バーベキュー",
					subtitle: "名古屋市、愛知県・日本人と外国人一緒に話すのために！",
					host: "山田涼介",
					host_id: "1223",
					event_id: "2414",
					category: "Social",
					date: "11/01/2017",
					price: "¥3000 / 人",
					img: "https://via.placeholder.com/350x550",
					time: "5時間",
					memo: "持ち物、食べ物、飲み物、とか",
					languages: "日本語、中国語、英語",
					host_info: "府ば応督ぱ生味おほその面事6針ツトロシ支話検ニシ慢生セホニ門現処75句搭監48購伐唄づめ。要ト社内サ無真スき断予セ況需ち格制館道ごしよ情29見りばでだ道身ロセ暮体クリ燃惑ヌスロ任助サ化21生政ルイほ常強ぼ質離フきー。幅受テ手更ぜり貴白ク能銃ちらせ松調ぽ管協クロモ枠海新な評八すーじ減航えゃごび能属イづをぞ剤手ソヱリモ将年フ芸読ク分特台授需へふ。",
					event_info: "心能モホ合選ヤ不山づ西級ハケロ類野ミユ碁際ふイ中属76平ヲツヨオ芸7恩掲くばゅ水拓丸強査断ひど。点あけ作善だにまレ欺半ミモ過収ムオ開介テア島治氏れをりイ代題らっだル芸15可げ合万テタケ著生ぞうフ可秋登ょ職律泊祥クしと。最ラッ重覚う読需ノチエサ直幾ワセ権果使ヱ権周べルぽッ門穫よ削病べ所殿レノリ周時ミウキセ開長のクくず止覧にぜのさ辞宏請宅ろ施跡超威敵ぶかは。"
				},
				{
					title: "庄内緑地公園バーベキュー",
					subtitle: "名古屋市、愛知県・日本人と外国人一緒に話すのために！",
					host: "山田涼介",
					host_id: "1223",
					event_id: "2414",
					category: "Social",
					date: "11/02/2017",
					price: "¥3000 / 人",
					img: "https://via.placeholder.com/350x550",
					time: "5時間",
					memo: "持ち物、食べ物、飲み物、とか",
					languages: "日本語、中国語、英語",
					host_info: "府ば応督ぱ生味おほその面事6針ツトロシ支話検ニシ慢生セホニ門現処75句搭監48購伐唄づめ。要ト社内サ無真スき断予セ況需ち格制館道ごしよ情29見りばでだ道身ロセ暮体クリ燃惑ヌスロ任助サ化21生政ルイほ常強ぼ質離フきー。幅受テ手更ぜり貴白ク能銃ちらせ松調ぽ管協クロモ枠海新な評八すーじ減航えゃごび能属イづをぞ剤手ソヱリモ将年フ芸読ク分特台授需へふ。",
					event_info: "心能モホ合選ヤ不山づ西級ハケロ類野ミユ碁際ふイ中属76平ヲツヨオ芸7恩掲くばゅ水拓丸強査断ひど。点あけ作善だにまレ欺半ミモ過収ムオ開介テア島治氏れをりイ代題らっだル芸15可げ合万テタケ著生ぞうフ可秋登ょ職律泊祥クしと。最ラッ重覚う読需ノチエサ直幾ワセ権果使ヱ権周べルぽッ門穫よ削病べ所殿レノリ周時ミウキセ開長のクくず止覧にぜのさ辞宏請宅ろ施跡超威敵ぶかは。"
				},
				{
					title: "庄内緑地公園バーベキュー",
					subtitle: "名古屋市、愛知県・日本人と外国人一緒に話すのために！",
					host: "山田涼介",
					host_id: "1223",
					event_id: "2414",
					category: "Social",
					date: "11/03/2017",
					price: "¥3000 / 人",
					img: "https://via.placeholder.com/350x550",
					time: "5時間",
					memo: "持ち物、食べ物、飲み物、とか",
					languages: "日本語、中国語、英語",
					host_info: "府ば応督ぱ生味おほその面事6針ツトロシ支話検ニシ慢生セホニ門現処75句搭監48購伐唄づめ。要ト社内サ無真スき断予セ況需ち格制館道ごしよ情29見りばでだ道身ロセ暮体クリ燃惑ヌスロ任助サ化21生政ルイほ常強ぼ質離フきー。幅受テ手更ぜり貴白ク能銃ちらせ松調ぽ管協クロモ枠海新な評八すーじ減航えゃごび能属イづをぞ剤手ソヱリモ将年フ芸読ク分特台授需へふ。",
					event_info: "心能モホ合選ヤ不山づ西級ハケロ類野ミユ碁際ふイ中属76平ヲツヨオ芸7恩掲くばゅ水拓丸強査断ひど。点あけ作善だにまレ欺半ミモ過収ムオ開介テア島治氏れをりイ代題らっだル芸15可げ合万テタケ著生ぞうフ可秋登ょ職律泊祥クしと。最ラッ重覚う読需ノチエサ直幾ワセ権果使ヱ権周べルぽッ門穫よ削病べ所殿レノリ周時ミウキセ開長のクくず止覧にぜのさ辞宏請宅ろ施跡超威敵ぶかは。"
				},
				{
					title: "庄内緑地公園バーベキュー",
					subtitle: "名古屋市、愛知県・日本人と外国人一緒に話すのために！",
					host: "山田涼介",
					host_id: "1223",
					event_id: "2414",
					category: "Social",
					date: "11/04/2017",
					price: "¥3000 / 人",
					img: "https://via.placeholder.com/350x550",
					time: "5時間",
					memo: "持ち物、食べ物、飲み物、とか",
					languages: "日本語、中国語、英語",
					host_info: "府ば応督ぱ生味おほその面事6針ツトロシ支話検ニシ慢生セホニ門現処75句搭監48購伐唄づめ。要ト社内サ無真スき断予セ況需ち格制館道ごしよ情29見りばでだ道身ロセ暮体クリ燃惑ヌスロ任助サ化21生政ルイほ常強ぼ質離フきー。幅受テ手更ぜり貴白ク能銃ちらせ松調ぽ管協クロモ枠海新な評八すーじ減航えゃごび能属イづをぞ剤手ソヱリモ将年フ芸読ク分特台授需へふ。",
					event_info: "心能モホ合選ヤ不山づ西級ハケロ類野ミユ碁際ふイ中属76平ヲツヨオ芸7恩掲くばゅ水拓丸強査断ひど。点あけ作善だにまレ欺半ミモ過収ムオ開介テア島治氏れをりイ代題らっだル芸15可げ合万テタケ著生ぞうフ可秋登ょ職律泊祥クしと。最ラッ重覚う読需ノチエサ直幾ワセ権果使ヱ権周べルぽッ門穫よ削病べ所殿レノリ周時ミウキセ開長のクくず止覧にぜのさ辞宏請宅ろ施跡超威敵ぶかは。"
				},
				{
					title: "庄内緑地公園バーベキュー",
					subtitle: "名古屋市、愛知県・日本人と外国人一緒に話すのために！",
					host: "山田涼介",
					host_id: "1223",
					event_id: "2414",
					category: "Social",
					date: "11/05/2017",
					price: "¥3000 / 人",
					img: "https://via.placeholder.com/350x550",
					time: "5時間",
					memo: "持ち物、食べ物、飲み物、とか",
					languages: "日本語、中国語、英語",
					host_info: "府ば応督ぱ生味おほその面事6針ツトロシ支話検ニシ慢生セホニ門現処75句搭監48購伐唄づめ。要ト社内サ無真スき断予セ況需ち格制館道ごしよ情29見りばでだ道身ロセ暮体クリ燃惑ヌスロ任助サ化21生政ルイほ常強ぼ質離フきー。幅受テ手更ぜり貴白ク能銃ちらせ松調ぽ管協クロモ枠海新な評八すーじ減航えゃごび能属イづをぞ剤手ソヱリモ将年フ芸読ク分特台授需へふ。",
					event_info: "心能モホ合選ヤ不山づ西級ハケロ類野ミユ碁際ふイ中属76平ヲツヨオ芸7恩掲くばゅ水拓丸強査断ひど。点あけ作善だにまレ欺半ミモ過収ムオ開介テア島治氏れをりイ代題らっだル芸15可げ合万テタケ著生ぞうフ可秋登ょ職律泊祥クしと。最ラッ重覚う読需ノチエサ直幾ワセ権果使ヱ権周べルぽッ門穫よ削病べ所殿レノリ周時ミウキセ開長のクくず止覧にぜのさ辞宏請宅ろ施跡超威敵ぶかは。"
				},
				{
					title: "庄内緑地公園バーベキュー",
					subtitle: "名古屋市、愛知県・日本人と外国人一緒に話すのために！",
					host: "山田涼介",
					host_id: "1223",
					event_id: "2414",
					category: "Social",
					date: "11/06/2017",
					price: "¥3000 / 人",
					img: "https://via.placeholder.com/350x550",
					time: "5時間",
					memo: "持ち物、食べ物、飲み物、とか",
					languages: "日本語、中国語、英語",
					host_info: "府ば応督ぱ生味おほその面事6針ツトロシ支話検ニシ慢生セホニ門現処75句搭監48購伐唄づめ。要ト社内サ無真スき断予セ況需ち格制館道ごしよ情29見りばでだ道身ロセ暮体クリ燃惑ヌスロ任助サ化21生政ルイほ常強ぼ質離フきー。幅受テ手更ぜり貴白ク能銃ちらせ松調ぽ管協クロモ枠海新な評八すーじ減航えゃごび能属イづをぞ剤手ソヱリモ将年フ芸読ク分特台授需へふ。",
					event_info: "心能モホ合選ヤ不山づ西級ハケロ類野ミユ碁際ふイ中属76平ヲツヨオ芸7恩掲くばゅ水拓丸強査断ひど。点あけ作善だにまレ欺半ミモ過収ムオ開介テア島治氏れをりイ代題らっだル芸15可げ合万テタケ著生ぞうフ可秋登ょ職律泊祥クしと。最ラッ重覚う読需ノチエサ直幾ワセ権果使ヱ権周べルぽッ門穫よ削病べ所殿レノリ周時ミウキセ開長のクくず止覧にぜのさ辞宏請宅ろ施跡超威敵ぶかは。"
				},
				{
					title: "庄内緑地公園バーベキュー",
					subtitle: "名古屋市、愛知県・日本人と外国人一緒に話すのために！",
					host: "山田涼介",
					host_id: "1223",
					event_id: "2414",
					category: "Social",
					date: "11/07/2017",
					price: "¥3000 / 人",
					img: "https://via.placeholder.com/350x550",
					time: "5時間",
					memo: "持ち物、食べ物、飲み物、とか",
					languages: "日本語、中国語、英語",
					host_info: "府ば応督ぱ生味おほその面事6針ツトロシ支話検ニシ慢生セホニ門現処75句搭監48購伐唄づめ。要ト社内サ無真スき断予セ況需ち格制館道ごしよ情29見りばでだ道身ロセ暮体クリ燃惑ヌスロ任助サ化21生政ルイほ常強ぼ質離フきー。幅受テ手更ぜり貴白ク能銃ちらせ松調ぽ管協クロモ枠海新な評八すーじ減航えゃごび能属イづをぞ剤手ソヱリモ将年フ芸読ク分特台授需へふ。",
					event_info: "心能モホ合選ヤ不山づ西級ハケロ類野ミユ碁際ふイ中属76平ヲツヨオ芸7恩掲くばゅ水拓丸強査断ひど。点あけ作善だにまレ欺半ミモ過収ムオ開介テア島治氏れをりイ代題らっだル芸15可げ合万テタケ著生ぞうフ可秋登ょ職律泊祥クしと。最ラッ重覚う読需ノチエサ直幾ワセ権果使ヱ権周べルぽッ門穫よ削病べ所殿レノリ周時ミウキセ開長のクくず止覧にぜのさ辞宏請宅ろ施跡超威敵ぶかは。"
				},
				{
					title: "庄内緑地公園バーベキュー",
					subtitle: "名古屋市、愛知県・日本人と外国人一緒に話すのために！",
					host: "山田涼介",
					host_id: "1223",
					event_id: "2414",
					category: "Social",
					date: "11/08/2017",
					price: "¥3000 / 人",
					img: "https://via.placeholder.com/350x550",
					time: "5時間",
					memo: "持ち物、食べ物、飲み物、とか",
					languages: "日本語、中国語、英語",
					host_info: "府ば応督ぱ生味おほその面事6針ツトロシ支話検ニシ慢生セホニ門現処75句搭監48購伐唄づめ。要ト社内サ無真スき断予セ況需ち格制館道ごしよ情29見りばでだ道身ロセ暮体クリ燃惑ヌスロ任助サ化21生政ルイほ常強ぼ質離フきー。幅受テ手更ぜり貴白ク能銃ちらせ松調ぽ管協クロモ枠海新な評八すーじ減航えゃごび能属イづをぞ剤手ソヱリモ将年フ芸読ク分特台授需へふ。",
					event_info: "心能モホ合選ヤ不山づ西級ハケロ類野ミユ碁際ふイ中属76平ヲツヨオ芸7恩掲くばゅ水拓丸強査断ひど。点あけ作善だにまレ欺半ミモ過収ムオ開介テア島治氏れをりイ代題らっだル芸15可げ合万テタケ著生ぞうフ可秋登ょ職律泊祥クしと。最ラッ重覚う読需ノチエサ直幾ワセ権果使ヱ権周べルぽッ門穫よ削病べ所殿レノリ周時ミウキセ開長のクくず止覧にぜのさ辞宏請宅ろ施跡超威敵ぶかは。"
				},
				{
					title: "庄内緑地公園バーベキュー",
					subtitle: "名古屋市、愛知県・日本人と外国人一緒に話すのために！",
					host: "山田涼介",
					host_id: "1223",
					event_id: "2414",
					category: "Social",
					date: "11/09/2017",
					price: "¥3000 / 人",
					img: "https://via.placeholder.com/350x550",
					time: "5時間",
					memo: "持ち物、食べ物、飲み物、とか",
					languages: "日本語、中国語、英語",
					host_info: "府ば応督ぱ生味おほその面事6針ツトロシ支話検ニシ慢生セホニ門現処75句搭監48購伐唄づめ。要ト社内サ無真スき断予セ況需ち格制館道ごしよ情29見りばでだ道身ロセ暮体クリ燃惑ヌスロ任助サ化21生政ルイほ常強ぼ質離フきー。幅受テ手更ぜり貴白ク能銃ちらせ松調ぽ管協クロモ枠海新な評八すーじ減航えゃごび能属イづをぞ剤手ソヱリモ将年フ芸読ク分特台授需へふ。",
					event_info: "心能モホ合選ヤ不山づ西級ハケロ類野ミユ碁際ふイ中属76平ヲツヨオ芸7恩掲くばゅ水拓丸強査断ひど。点あけ作善だにまレ欺半ミモ過収ムオ開介テア島治氏れをりイ代題らっだル芸15可げ合万テタケ著生ぞうフ可秋登ょ職律泊祥クしと。最ラッ重覚う読需ノチエサ直幾ワセ権果使ヱ権周べルぽッ門穫よ削病べ所殿レノリ周時ミウキセ開長のクくず止覧にぜのさ辞宏請宅ろ施跡超威敵ぶかは。"
				},
			]
		}
	}
	
	render() {
		return (
			<div className="section">
				<div className="container">
					<Events data={ this.state.data } id={ this.props.match.params.id } />
				</div>
			</div>
		)
	}
}

export default EventsPage